README.org
#+TITLE: Essentials Emacs
#+AUTHOR: Sidharth Arya 

This are just some basic tweaky functions which I find useful. Please don't just use this package. Read through it's functions. They are pretty simple, straightforward and useful. Maybe helpful if you are just beginning to use emacs. Also use ~C-h v~ describe variable and ~C-h f~ describe function to get the gist of certain functions.
Think about this package as a basic tutorial of elisp.

* Basic Usage
Just put this directly into you emacs config file
#+BEGIN_SRC emacs-lisp
(load "path to essential.el")
(require 'essential)
#+END_SRC

** Dynamic Font Size Manipulation
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-+") 'increase-font-size)
(global-set-key (kbd "C--") 'decrease-font-size)
#+END_SRC
** Toggle Hidden Characters
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-|") 'toggle-hidden-chars)
#+END_SRC
** Tab Width
Try messing with numbers here.
#+BEGIN_SRC emacs-lisp
(setq tab-width 100)
#+END_SRC
